; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob4931) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 distributor0)
	(clear crate1)
	(at pallet2 distributor1)
	(clear crate3)
	(at truck0 distributor1)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(at crate2 distributor1)
	(on crate2 crate0)
	(at crate3 distributor1)
	(on crate3 crate2)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 pallet0)
		(on crate2 pallet1)
		(on crate3 pallet2)
	)
))

; plan
1. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 0 of 4
2. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 0 of 4
3. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 4
4. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 0 of 4
5. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 0 of 4
6. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 4
7. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   goals met: 0 of 4
8. (drop hoist0 crate1 pallet0 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet0)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet0)
   goals met: 1 of 4
9. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 1 of 4
10. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   goals met: 1 of 4
11. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 1 of 4
12. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   goals met: 1 of 4
13. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 1 of 4
14. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 1 of 4
15. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 1 of 4
16. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 1 of 4
17. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 pallet1)
   goals met: 2 of 4
18. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 2 of 4
19. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   goals met: 2 of 4
20. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 2 of 4
21. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 2 of 4
22. (unload hoist1 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   goals met: 2 of 4
23. (drop hoist2 crate3 pallet2 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 pallet2)
   goals met: 3 of 4
24. (drop hoist1 crate0 crate2 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate2)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate2)
   goals met: 4 of 4
